---
kind: method
id: M:Autodesk.Revit.UI.ContextualHelp.Launch
source: html/b86876ed-8a69-5c48-e22c-c56e21afa1ac.htm
---
# Autodesk.Revit.UI.ContextualHelp.Launch Method

Launches and displays the help topic specified by the contents of this ContextualHelp object.

## Syntax (C#)
```csharp
public void Launch()
```